# Chapter 06 Pandas

In [1]:
import numpy as np
import pandas as pd # 가장 대중적인 Pandas 치환

## Series

data, index, name, dtype으로 구성된 1차원 자료 구조 (ndarray 객체에서 index와 name추가)

### creation

In [2]:
data = [1, 2, 3, 4, 5]
print(pd.Series(data)) # index의 default값은 0부터 1씩 증가

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
print(pd.Series(data, name='Series')) # name 설정, default는 name 없음

0    1
1    2
2    3
3    4
4    5
Name: Series, dtype: int64

In [4]:
print(pd.Series(data, index=list('abcde'))) # index 설정 시 data 순서대로 할당

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [5]:
print(pd.Series(data, dtype=float)) # dtype 설정 시 data의 형태 변환

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [6]:
dict_data = {'a': 10, 'b': 20, 'c': 30, 'd': 40} # using dictionary for Series creation 
print(pd.Series(dict_data)) # key : index, value : data

a    10
b    20
c    30
d    40
dtype: int64

### component

In [7]:
sr = pd.Series([1, 2, 3, 4], index=list('abcd'), name='Series')
print(sr)

a    1
b    2
c    3
d    4
Name: Series, dtype: int64

In [8]:
print(sr.values)

[1 2 3 4]

In [9]:
print(sr.index)

Index(['a', 'b', 'c', 'd'], dtype='object')

In [10]:
print(sr.dtype)

int64

In [11]:
print(sr.name)

Series

In [12]:
sr.index = list('efgh') # sr = sr.reindex(list('efgh'))
print(sr)

e    1
f    2
g    3
h    4
Name: Series, dtype: int64

In [13]:
sr = sr.astype(int)
print(sr)

e    1
f    2
g    3
h    4
Name: Series, dtype: int32

In [14]:
sr.name = 'Series_2'
print(sr)

e    1
f    2
g    3
h    4
Name: Series_2, dtype: int32

In [15]:
sr.index.name = 'alphabet'
print(sr)

alphabet
e    1
f    2
g    3
h    4
Name: Series_2, dtype: int32

### indexing & slicing

In [16]:
sr = pd.Series(range(1, 5), index=list('abcd'))
print(sr)

a    1
b    2
c    3
d    4
dtype: int64

In [17]:
print(sr[1])

2

In [18]:
print(sr[[1, 3]])

b    2
d    4
dtype: int64

- loc (location: series index의 이름으로 indexing)
- iloc (index location: series index의 순서로 indexing)

In [19]:
print(sr.loc['c'])

3

In [20]:
print(sr.loc[['a', 'b']])

a    1
b    2
dtype: int64

In [21]:
print(sr.iloc[2])

3

In [22]:
print(sr.iloc[[0, 1]])

a    1
b    2
dtype: int64

In [23]:
sr = pd.Series(range(1, 6), index=[3, 7, 4, 5, 6])
print(sr)

3    1
7    2
4    3
5    4
6    5
dtype: int64

In [24]:
print(sr.loc[3])
print(sr.iloc[3])

1
4

In [25]:
print(sr.loc[3:5])
print(sr.iloc[3:5])

3    1
7    2
4    3
5    4
dtype: int64
5    4
6    5
dtype: int64

In [26]:
print(sr.loc[7::2])
print(sr.iloc[3::2])

7    2
5    4
dtype: int64
5    4
dtype: int64

### add, remove, modify

In [27]:
sr = pd.Series(range(1, 5), index=list('abcd'))
print(sr)

a    1
b    2
c    3
d    4
dtype: int64

In [28]:
sr['e'] = 100
print(sr)

a      1
b      2
c      3
d      4
e    100
dtype: int64

In [29]:
sr['a'] = 10
print(sr)

a     10
b      2
c      3
d      4
e    100
dtype: int64

In [30]:
sr.loc['b'] = 20
print(sr)

a     10
b     20
c      3
d      4
e    100
dtype: int64

In [31]:
sr[2] = 30
print(sr)

a     10
b     20
c     30
d      4
e    100
dtype: int64

In [32]:
sr.iloc[3] = 40
print(sr)

a     10
b     20
c     30
d     40
e    100
dtype: int64

In [33]:
del sr['a']
print(sr)

b     20
c     30
d     40
e    100
dtype: int64

### operation

#### one series

In [34]:
sr = pd.Series([1, 2, 5, 4, 3])
print(sr)

0    1
1    2
2    5
3    4
4    3
dtype: int64

In [35]:
print(np.any(sr > 2))
print(np.all(sr > 2))
print(np.max(sr))
print(np.min(sr))
print(np.sum(sr))
print(np.argmax(sr)) # index of maximum value
print(np.mean(sr))
print(np.exp(sr))

True
False
5
1
15
2
3.0
0      2.718282
1      7.389056
2    148.413159
3     54.598150
4     20.085537
dtype: float64

In [36]:
print(sr.sort_index())

0    1
1    2
2    5
3    4
4    3
dtype: int64

In [37]:
print(sr.sort_values())

0    1
1    2
4    3
3    4
2    5
dtype: int64

#### two series

In [38]:
sr1 = pd.Series(range(1, 6), index=list('ceabd'), name='sr1')
print(sr1)

c    1
e    2
a    3
b    4
d    5
Name: sr1, dtype: int64

In [39]:
sr2 = pd.Series(range(11, 17), index=list('daecbz'), name='sr2')
print(sr2)

d    11
a    12
e    13
c    14
b    15
z    16
Name: sr2, dtype: int64

In [40]:
print(sr1 > 3)

c    False
e    False
a    False
b     True
d     True
Name: sr1, dtype: bool

In [41]:
print(sr1[sr1 > 3])

b    4
d    5
Name: sr1, dtype: int64

In [42]:
print(sr1 + sr2) # = sr1.add(sr2)

a    15.0
b    19.0
c    15.0
d    16.0
e    15.0
z     NaN
dtype: float64

In [43]:
print(sr1 - sr2) # = sr1.sub(sr2)

a    -9.0
b   -11.0
c   -13.0
d    -6.0
e   -11.0
z     NaN
dtype: float64

In [44]:
print(sr1 * sr2) # = sr1.mul(sr2)

a    36.0
b    60.0
c    14.0
d    55.0
e    26.0
z     NaN
dtype: float64

In [45]:
print(sr1 / sr2) # = sr1.div(sr2)

a    0.250000
b    0.266667
c    0.071429
d    0.454545
e    0.153846
z         NaN
dtype: float64

In [46]:
print(sr1.add(sr2, fill_value=100))

a     15.0
b     19.0
c     15.0
d     16.0
e     15.0
z    116.0
dtype: float64

In [47]:
sr1 = pd.Series([3, 2, 1, 4, 5], index=list('cdbef'), name='sr1')
sr2 = pd.Series([3, 2, 1, 4, 5], index=list('abcde'), name='sr2')
sr3 = sr1 + sr2
print(sr3)

a    NaN
b    3.0
c    4.0
d    6.0
e    9.0
f    NaN
dtype: float64

In [48]:
print(sr3.isnull())

a     True
b    False
c    False
d    False
e    False
f     True
dtype: bool

In [49]:
print(sr3.notnull())

a    False
b     True
c     True
d     True
e     True
f    False
dtype: bool

In [50]:
print(np.sum(sr3.isnull())) # sr3에서 Null(NaN)의 수

2

In [51]:
print(np.sum(sr3.notnull())) # sr3에서 Null(NaN)이 아닌 값의 수

4

#### map

In [52]:
sr = pd.Series(np.arange(7))

In [53]:
def f1(x):
    return x**2

print(sr.map(f1))

0     0
1     1
2     4
3     9
4    16
5    25
6    36
dtype: int64

In [54]:
def f2(x):
    if x > 4:
        return 'Big'
    elif x > 2:
        return 'MIddle'
    else:
        return 'Small'
    
print(sr.map(f2))

0     Small
1     Small
2     Small
3    MIddle
4    MIddle
5       Big
6       Big
dtype: object

In [55]:
def f3(x):
    return x + 2

print(sr.map(f3)) # 1
# print(sr.map(lambda x: x + 2)) # 2
# print(sr + 2) # 3

0    2
1    3
2    4
3    5
4    6
5    7
6    8
dtype: int64

In [56]:
print(sr.map({1: 'a', 2: 'b'}))

0    NaN
1      a
2      b
3    NaN
4    NaN
5    NaN
6    NaN
dtype: object

In [57]:
print(sr.replace({1: 'a', 2: 'b'}))

0    0
1    a
2    b
3    3
4    4
5    5
6    6
dtype: object

## DataFrame

data, index, columns(Series들의 name모음), dtype으로 구성된 2차원 자료 구조  
※ DataFrame 챕터에서는 출력물의 형태를 가시적으로 인식하기 편하게 print문 사용 x

### creation

In [58]:
data = [[1, 2, 3, 4], ['a', 6, 7, 8], [9, 10, '11', 12]]
pd.DataFrame(data) # index, column의 default값은 0부터 1씩 증가

   0   1   2   3
0  1   2   3   4
1  a   6   7   8
2  9  10  11  12

In [59]:
pd.DataFrame(data, index=list('abc')) # index 설정 시 data 순서대로 할당

   0   1   2   3
a  1   2   3   4
b  a   6   7   8
c  9  10  11  12

In [60]:
pd.DataFrame(data, columns=list('ABCD')) # column 설정 시 data 순서대로 할당

   A   B   C   D
0  1   2   3   4
1  a   6   7   8
2  9  10  11  12

In [61]:
pd.DataFrame(data, dtype=float) # column 별로 형태 변환

   0     1     2     3
0  1   2.0   3.0   4.0
1  a   6.0   7.0   8.0
2  9  10.0  11.0  12.0

In [62]:
dict_data = {'a': [1, 2, 3], 'b': [2, 3, 4], 'c': [3, 4, 5]} # using dictionary for DataFrame creation 
pd.DataFrame(dict_data, index=list('ABC')) # key: column, value: data

   a  b  c
A  1  2  3
B  2  3  4
C  3  4  5

In [63]:
dict_data = {'a': {'d': 1, 'e': 2}, 'b': {'d': 10, 'e': 20}, 'c': {'d': 100, 'e': 200, 'f': 300}}
pd.DataFrame(dict_data) # key: column, nested key: index, nested value: data

     a     b    c
d  1.0  10.0  100
e  2.0  20.0  200
f  NaN   NaN  300

file load

In [64]:
df = pd.read_table('table_data.txt', sep='\t')
df.head() # head=첫 5행, tail=마지막 5행

    이름 성별  학년   출석   과제   중간   기말
0  김혁주  남   4   85   75   90   95
1  홍길동  남   3   85   90   85   88
2  유재석  남   3  100  100  100  100
3  장미란  여   4   90   85   80   78
4  박명수  남   4   90   80   80   80

In [65]:
df = pd.read_table('table_data.txt', header=None, sep='\t')
df.head()

     0   1   2    3    4    5    6
0   이름  성별  학년   출석   과제   중간   기말
1  김혁주   남   4   85   75   90   95
2  홍길동   남   3   85   90   85   88
3  유재석   남   3  100  100  100  100
4  장미란   여   4   90   85   80   78

In [66]:
df = pd.read_table('table_data.txt', index_col='이름', sep='\t')
df.head() # column 중에 index로 사용할 column 지정

    성별  학년   출석   과제   중간   기말
이름
김혁주  남   4   85   75   90   95
홍길동  남   3   85   90   85   88
유재석  남   3  100  100  100  100
장미란  여   4   90   85   80   78
박명수  남   4   90   80   80   80

In [67]:
df.index.name = None
df.head()

    성별  학년   출석   과제   중간   기말
김혁주  남   4   85   75   90   95
홍길동  남   3   85   90   85   88
유재석  남   3  100  100  100  100
장미란  여   4   90   85   80   78
박명수  남   4   90   80   80   80

In [68]:
df = pd.read_table('table_data.txt', index_col='이름', usecols=['이름', '출석', '과제'], sep='\t')
df.head() # 출력할 column 지정

      출석   과제
이름
김혁주   85   75
홍길동   85   90
유재석  100  100
장미란   90   85
박명수   90   80

### component

In [69]:
data = np.arange(12).reshape(3, 4)
df = pd.DataFrame(data, index=[1, 2, 3], columns=list('abcd'))
df

   a  b   c   d
1  0  1   2   3
2  4  5   6   7
3  8  9  10  11

In [70]:
df.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [71]:
df.index

Int64Index([1, 2, 3], dtype='int64')

In [72]:
df.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [73]:
df.dtypes

a    int32
b    int32
c    int32
d    int32
dtype: object

In [74]:
df.index.name = 'Numeric'
df

         a  b   c   d
Numeric
1        0  1   2   3
2        4  5   6   7
3        8  9  10  11

In [75]:
df.columns.name = 'Alphabet'
df

Alphabet  a  b   c   d
Numeric
1         0  1   2   3
2         4  5   6   7
3         8  9  10  11

In [76]:
df.loc[1] = np.arange(50, 54).reshape(1, 4)
df

Alphabet   a   b   c   d
Numeric
1         50  51  52  53
2          4   5   6   7
3          8   9  10  11

In [77]:
df['c'] = [10, 20, 30]
df

Alphabet   a   b   c   d
Numeric
1         50  51  10  53
2          4   5  20   7
3          8   9  30  11

In [78]:
df[:] = np.arange(100, 112).reshape(3, 4)
df

Alphabet    a    b    c    d
Numeric
1         100  101  102  103
2         104  105  106  107
3         108  109  110  111

In [79]:
df.index = list('ABC')
df

Alphabet    a    b    c    d
A         100  101  102  103
B         104  105  106  107
C         108  109  110  111

In [80]:
df['b'] = df['b'].astype(int)
df

Alphabet    a    b    c    d
A         100  101  102  103
B         104  105  106  107
C         108  109  110  111

In [81]:
df = df.astype(float)
df

Alphabet      a      b      c      d
A         100.0  101.0  102.0  103.0
B         104.0  105.0  106.0  107.0
C         108.0  109.0  110.0  111.0

### indexing & slicing

#### row indexing

In [82]:
data = np.arange(16).reshape(4, 4)
df = pd.DataFrame(data, index=[10, 20, 30, 40], columns=list('abcd'))
df

     a   b   c   d
10   0   1   2   3
20   4   5   6   7
30   8   9  10  11
40  12  13  14  15

In [83]:
df.loc[10] # Series 형태로 반환

a    0
b    1
c    2
d    3
Name: 10, dtype: int32

In [84]:
df.loc[[10]] # DataFrame 형태로 반환

    a  b  c  d
10  0  1  2  3

In [85]:
df.loc[[10, 20, 40]]

     a   b   c   d
10   0   1   2   3
20   4   5   6   7
40  12  13  14  15

In [86]:
df.loc[10:30]

    a  b   c   d
10  0  1   2   3
20  4  5   6   7
30  8  9  10  11

In [87]:
df.iloc[2] # Series 형태로 반환

a     8
b     9
c    10
d    11
Name: 30, dtype: int32

In [88]:
df.iloc[[2]] # DataFrame 형태로 반환

    a  b   c   d
30  8  9  10  11

In [89]:
df.iloc[[0, 2]]

    a  b   c   d
10  0  1   2   3
30  8  9  10  11

In [90]:
df.iloc[:3] # = df.head(3)

    a  b   c   d
10  0  1   2   3
20  4  5   6   7
30  8  9  10  11

In [91]:
df.iloc[-3:] # = df.tail(3)

     a   b   c   d
20   4   5   6   7
30   8   9  10  11
40  12  13  14  15

#### column indexing

In [92]:
df = pd.read_table('table_data.txt', index_col='이름', sep='\t')
df.index.name = None
df

    성별  학년   출석   과제   중간   기말
김혁주  남   4   85   75   90   95
홍길동  남   3   85   90   85   88
유재석  남   3  100  100  100  100
장미란  여   4   90   85   80   78
박명수  남   4   90   80   80   80
정형돈  남   2   80   99   88   90
김연아  여   1   75   80  100  100
조유리  여   2   85   90   90   89
하동훈  남   1   75   85  100   85

In [93]:
df['출석'] # Series 형태로 반환

김혁주     85
홍길동     85
유재석    100
장미란     90
박명수     90
정형돈     80
김연아     75
조유리     85
하동훈     75
Name: 출석, dtype: int64

In [94]:
df[['출석']] # DataFrame 형태로 반환

      출석
김혁주   85
홍길동   85
유재석  100
장미란   90
박명수   90
정형돈   80
김연아   75
조유리   85
하동훈   75

In [95]:
df.loc[:, '중간'] # = df.iloc[:, 2]

김혁주     90
홍길동     85
유재석    100
장미란     80
박명수     80
정형돈     88
김연아    100
조유리     90
하동훈    100
Name: 중간, dtype: int64

In [96]:
df.loc[:, '과제':'중간']

      과제   중간
김혁주   75   90
홍길동   90   85
유재석  100  100
장미란   85   80
박명수   80   80
정형돈   99   88
김연아   80  100
조유리   90   90
하동훈   85  100

In [97]:
df.iloc[:, 3] # = df.loc[:, '기말']

김혁주     75
홍길동     90
유재석    100
장미란     85
박명수     80
정형돈     99
김연아     80
조유리     90
하동훈     85
Name: 과제, dtype: int64

In [98]:
df.iloc[:, :2]

    성별  학년
김혁주  남   4
홍길동  남   3
유재석  남   3
장미란  여   4
박명수  남   4
정형돈  남   2
김연아  여   1
조유리  여   2
하동훈  남   1

#### element indexing

In [99]:
df = pd.read_table('table_data.txt', index_col='이름', sep='\t')
df.index.name = None
df

    성별  학년   출석   과제   중간   기말
김혁주  남   4   85   75   90   95
홍길동  남   3   85   90   85   88
유재석  남   3  100  100  100  100
장미란  여   4   90   85   80   78
박명수  남   4   90   80   80   80
정형돈  남   2   80   99   88   90
김연아  여   1   75   80  100  100
조유리  여   2   85   90   90   89
하동훈  남   1   75   85  100   85

In [100]:
df.loc['홍길동', '출석'] # Scalar 형태로 반환

85

In [101]:
df.loc[['홍길동'], '출석'] # Series 형태로 반환

홍길동    85
Name: 출석, dtype: int64

In [102]:
df.loc['홍길동', ['출석']] # Series 형태로 반환

출석    85
Name: 홍길동, dtype: object

In [103]:
df.loc[['홍길동'], ['출석']] # DataFrame 형태로 반환

     출석
홍길동  85

In [104]:
df.iloc[3, [2, 3]]

출석    90
과제    85
Name: 장미란, dtype: object

In [105]:
df.iloc[[3], [2, 3]] # DataFrame 형태로 반환

     출석  과제
장미란  90  85

In [106]:
df.iloc[[1, 2, 3], :2]

    성별  학년
홍길동  남   3
유재석  남   3
장미란  여   4

In [107]:
df.iloc[-3:, :7:2]

    성별  출석   중간
김연아  여  75  100
조유리  여  85   90
하동훈  남  75  100

#### boolean indexing

In [108]:
data = np.arange(16).reshape(4, 4)
df = pd.DataFrame(data, index=[10, 20, 30, 40], columns=list('abcd'), dtype=float)
df

       a     b     c     d
10   0.0   1.0   2.0   3.0
20   4.0   5.0   6.0   7.0
30   8.0   9.0  10.0  11.0
40  12.0  13.0  14.0  15.0

In [109]:
df.loc[[True, True, False, True], ['a', 'b']]

       a     b
10   0.0   1.0
20   4.0   5.0
40  12.0  13.0

In [110]:
df.loc[[10, 30], [True, True, False, True]]

      a    b     d
10  0.0  1.0   3.0
30  8.0  9.0  11.0

In [111]:
df.loc[[True, False, False, True], [True, True, False, True]]

       a     b     d
10   0.0   1.0   3.0
40  12.0  13.0  15.0

In [112]:
df.iloc[[False, True, False, True], [1, 3]]

       b     d
20   5.0   7.0
40  13.0  15.0

In [113]:
df.iloc[[0], [True, False, False, True]]

      a    d
10  0.0  3.0

In [114]:
df.iloc[[False, True, False, True], [True, False, False, True]]

       a     d
20   4.0   7.0
40  12.0  15.0

In [115]:
df.loc[df['c'] > 9, ['a', 'd']]

       a     d
30   8.0  11.0
40  12.0  15.0

### add, remove, modify

In [116]:
data = np.arange(16).reshape(4, 4)
df = pd.DataFrame(data, index=[10, 20, 30, 40], columns=list('abcd'), dtype=float)
df

       a     b     c     d
10   0.0   1.0   2.0   3.0
20   4.0   5.0   6.0   7.0
30   8.0   9.0  10.0  11.0
40  12.0  13.0  14.0  15.0

In [117]:
df.loc[50] = [1, 2, 3, 4]
df

       a     b     c     d
10   0.0   1.0   2.0   3.0
20   4.0   5.0   6.0   7.0
30   8.0   9.0  10.0  11.0
40  12.0  13.0  14.0  15.0
50   1.0   2.0   3.0   4.0

In [118]:
df['e'] = [1, 2, 3, 4, 5]
df

       a     b     c     d  e
10   0.0   1.0   2.0   3.0  1
20   4.0   5.0   6.0   7.0  2
30   8.0   9.0  10.0  11.0  3
40  12.0  13.0  14.0  15.0  4
50   1.0   2.0   3.0   4.0  5

In [119]:
df['f'] = df['c'] > 5
df

       a     b     c     d  e      f
10   0.0   1.0   2.0   3.0  1  False
20   4.0   5.0   6.0   7.0  2   True
30   8.0   9.0  10.0  11.0  3   True
40  12.0  13.0  14.0  15.0  4   True
50   1.0   2.0   3.0   4.0  5  False

In [120]:
df['g'] = np.where(df['a']%3 == 0, 1, 10)
df

       a     b     c     d  e      f   g
10   0.0   1.0   2.0   3.0  1  False   1
20   4.0   5.0   6.0   7.0  2   True  10
30   8.0   9.0  10.0  11.0  3   True  10
40  12.0  13.0  14.0  15.0  4   True   1
50   1.0   2.0   3.0   4.0  5  False  10

In [121]:
del df['a']
df

       b     c     d  e      f   g
10   1.0   2.0   3.0  1  False   1
20   5.0   6.0   7.0  2   True  10
30   9.0  10.0  11.0  3   True  10
40  13.0  14.0  15.0  4   True   1
50   2.0   3.0   4.0  5  False  10

In [122]:
df.drop(['b', 'c'], axis=1, inplace=True)
df

       d  e      f   g
10   3.0  1  False   1
20   7.0  2   True  10
30  11.0  3   True  10
40  15.0  4   True   1
50   4.0  5  False  10

In [123]:
df.drop([10, 30], axis=0, inplace=True)
df

       d  e      f   g
20   7.0  2   True  10
40  15.0  4   True   1
50   4.0  5  False  10

In [124]:
df.loc[40] = [1, 2, 3, 4]
df

      d  e      f   g
20  7.0  2   True  10
40  1.0  2      3   4
50  4.0  5  False  10

### operation

#### one dataframe

In [125]:
df = pd.read_table('table_data.txt', index_col='이름', sep='\t')
df.index.name = None
df

    성별  학년   출석   과제   중간   기말
김혁주  남   4   85   75   90   95
홍길동  남   3   85   90   85   88
유재석  남   3  100  100  100  100
장미란  여   4   90   85   80   78
박명수  남   4   90   80   80   80
정형돈  남   2   80   99   88   90
김연아  여   1   75   80  100  100
조유리  여   2   85   90   90   89
하동훈  남   1   75   85  100   85

In [126]:
df.describe() # std : ddof = 1

             학년          출석          과제          중간          기말
count  9.000000    9.000000    9.000000    9.000000    9.000000
mean   2.666667   85.000000   87.111111   90.333333   89.444444
std    1.224745    7.905694    8.521215    8.124038    7.875772
min    1.000000   75.000000   75.000000   80.000000   78.000000
25%    2.000000   80.000000   80.000000   85.000000   85.000000
50%    3.000000   85.000000   85.000000   90.000000   89.000000
75%    4.000000   90.000000   90.000000  100.000000   95.000000
max    4.000000  100.000000  100.000000  100.000000  100.000000

In [127]:
df.std() # std : ddof = 1

학년    1.224745
출석    7.905694
과제    8.521215
중간    8.124038
기말    7.875772
dtype: float64

In [128]:
df.std(ddof = 0) # std : ddof = 0

학년    1.154701
출석    7.453560
과제    8.033879
중간    7.659417
기말    7.425349
dtype: float64

In [129]:
np.std(df) # std : ddof = 0

학년    1.154701
출석    7.453560
과제    8.033879
중간    7.659417
기말    7.425349
dtype: float64

In [130]:
df.sort_index(ascending=False)

    성별  학년   출석   과제   중간   기말
홍길동  남   3   85   90   85   88
하동훈  남   1   75   85  100   85
조유리  여   2   85   90   90   89
정형돈  남   2   80   99   88   90
장미란  여   4   90   85   80   78
유재석  남   3  100  100  100  100
박명수  남   4   90   80   80   80
김혁주  남   4   85   75   90   95
김연아  여   1   75   80  100  100

In [131]:
df.sort_index(axis=1)

      과제   기말 성별   중간   출석  학년
김혁주   75   95  남   90   85   4
홍길동   90   88  남   85   85   3
유재석  100  100  남  100  100   3
장미란   85   78  여   80   90   4
박명수   80   80  남   80   90   4
정형돈   99   90  남   88   80   2
김연아   80  100  여  100   75   1
조유리   90   89  여   90   85   2
하동훈   85   85  남  100   75   1

In [132]:
df.sort_values('기말')

    성별  학년   출석   과제   중간   기말
장미란  여   4   90   85   80   78
박명수  남   4   90   80   80   80
하동훈  남   1   75   85  100   85
홍길동  남   3   85   90   85   88
조유리  여   2   85   90   90   89
정형돈  남   2   80   99   88   90
김혁주  남   4   85   75   90   95
유재석  남   3  100  100  100  100
김연아  여   1   75   80  100  100

In [133]:
df.sort_values(['기말', '중간'])

    성별  학년   출석   과제   중간   기말
장미란  여   4   90   85   80   78
박명수  남   4   90   80   80   80
하동훈  남   1   75   85  100   85
홍길동  남   3   85   90   85   88
조유리  여   2   85   90   90   89
정형돈  남   2   80   99   88   90
김혁주  남   4   85   75   90   95
유재석  남   3  100  100  100  100
김연아  여   1   75   80  100  100

In [134]:
df.rank()

      성별   학년   출석   과제   중간   기말
김혁주  3.5  8.0  5.0  1.0  5.5  7.0
홍길동  3.5  5.5  5.0  6.5  3.0  4.0
유재석  3.5  5.5  9.0  9.0  8.0  8.5
장미란  8.0  8.0  7.5  4.5  1.5  1.0
박명수  3.5  8.0  7.5  2.5  1.5  2.0
정형돈  3.5  3.5  3.0  8.0  4.0  6.0
김연아  8.0  1.5  1.5  2.5  8.0  8.5
조유리  8.0  3.5  5.0  6.5  5.5  5.0
하동훈  3.5  1.5  1.5  4.5  8.0  3.0

In [135]:
df.rank(axis=1)

      학년   출석   과제   중간   기말
김혁주  1.0  3.0  2.0  4.0  5.0
홍길동  1.0  2.5  5.0  2.5  4.0
유재석  1.0  3.5  3.5  3.5  3.5
장미란  1.0  5.0  4.0  3.0  2.0
박명수  1.0  5.0  3.0  3.0  3.0
정형돈  1.0  2.0  5.0  3.0  4.0
김연아  1.0  2.0  3.0  4.5  4.5
조유리  1.0  2.0  4.5  4.5  3.0
하동훈  1.0  2.0  3.5  5.0  3.5

In [136]:
df['중간'].unique()

array([ 90,  85, 100,  80,  88], dtype=int64)

In [137]:
df['학년'].unique()

array([4, 3, 2, 1], dtype=int64)

In [138]:
data = {'a': [1, 2, np.nan], 'b': [10, np.nan, np.nan], 'c': [1, 2, np.nan]}
df

    성별  학년   출석   과제   중간   기말
김혁주  남   4   85   75   90   95
홍길동  남   3   85   90   85   88
유재석  남   3  100  100  100  100
장미란  여   4   90   85   80   78
박명수  남   4   90   80   80   80
정형돈  남   2   80   99   88   90
김연아  여   1   75   80  100  100
조유리  여   2   85   90   90   89
하동훈  남   1   75   85  100   85

In [139]:
df.isnull()

        성별     학년     출석     과제     중간     기말
김혁주  False  False  False  False  False  False
홍길동  False  False  False  False  False  False
유재석  False  False  False  False  False  False
장미란  False  False  False  False  False  False
박명수  False  False  False  False  False  False
정형돈  False  False  False  False  False  False
김연아  False  False  False  False  False  False
조유리  False  False  False  False  False  False
하동훈  False  False  False  False  False  False

In [140]:
df.isnull().sum()

성별    0
학년    0
출석    0
과제    0
중간    0
기말    0
dtype: int64

In [141]:
df.isnull().sum(axis=1)

김혁주    0
홍길동    0
유재석    0
장미란    0
박명수    0
정형돈    0
김연아    0
조유리    0
하동훈    0
dtype: int64

In [142]:
df.isnull().sum().sum()

0

In [143]:
df.fillna(-10)

    성별  학년   출석   과제   중간   기말
김혁주  남   4   85   75   90   95
홍길동  남   3   85   90   85   88
유재석  남   3  100  100  100  100
장미란  여   4   90   85   80   78
박명수  남   4   90   80   80   80
정형돈  남   2   80   99   88   90
김연아  여   1   75   80  100  100
조유리  여   2   85   90   90   89
하동훈  남   1   75   85  100   85

In [144]:
df.fillna({'a': 100, 'b': 200, 'c': 300})

    성별  학년   출석   과제   중간   기말
김혁주  남   4   85   75   90   95
홍길동  남   3   85   90   85   88
유재석  남   3  100  100  100  100
장미란  여   4   90   85   80   78
박명수  남   4   90   80   80   80
정형돈  남   2   80   99   88   90
김연아  여   1   75   80  100  100
조유리  여   2   85   90   90   89
하동훈  남   1   75   85  100   85

In [145]:
df = pd.read_table('table_data.txt', sep='\t')
df

    이름 성별  학년   출석   과제   중간   기말
0  김혁주  남   4   85   75   90   95
1  홍길동  남   3   85   90   85   88
2  유재석  남   3  100  100  100  100
3  장미란  여   4   90   85   80   78
4  박명수  남   4   90   80   80   80
5  정형돈  남   2   80   99   88   90
6  김연아  여   1   75   80  100  100
7  조유리  여   2   85   90   90   89
8  하동훈  남   1   75   85  100   85

In [146]:
df.set_index('이름', inplace=True)
df

    성별  학년   출석   과제   중간   기말
이름
김혁주  남   4   85   75   90   95
홍길동  남   3   85   90   85   88
유재석  남   3  100  100  100  100
장미란  여   4   90   85   80   78
박명수  남   4   90   80   80   80
정형돈  남   2   80   99   88   90
김연아  여   1   75   80  100  100
조유리  여   2   85   90   90   89
하동훈  남   1   75   85  100   85

In [147]:
df.reset_index(inplace=True)
df

    이름 성별  학년   출석   과제   중간   기말
0  김혁주  남   4   85   75   90   95
1  홍길동  남   3   85   90   85   88
2  유재석  남   3  100  100  100  100
3  장미란  여   4   90   85   80   78
4  박명수  남   4   90   80   80   80
5  정형돈  남   2   80   99   88   90
6  김연아  여   1   75   80  100  100
7  조유리  여   2   85   90   90   89
8  하동훈  남   1   75   85  100   85

#### two dataframe

In [148]:
data = {'a': [1, 2, 3], 'b': [4, 5, 6], 'c': [1, 2, 3]}

In [149]:
df1 = pd.DataFrame(data, index=['a1', 'a2', 'a3'])
df1

    a  b  c
a1  1  4  1
a2  2  5  2
a3  3  6  3

In [150]:
df2 = pd.DataFrame(data, index=['a1', 'a2', 'a4'])
df2

    a  b  c
a1  1  4  1
a2  2  5  2
a4  3  6  3

In [151]:
df1 * df2

      a     b    c
a1  1.0  16.0  1.0
a2  4.0  25.0  4.0
a3  NaN   NaN  NaN
a4  NaN   NaN  NaN

In [152]:
df1.mul(df2)

      a     b    c
a1  1.0  16.0  1.0
a2  4.0  25.0  4.0
a3  NaN   NaN  NaN
a4  NaN   NaN  NaN

In [153]:
df1.mul(df2, fill_value=3)

      a     b    c
a1  1.0  16.0  1.0
a2  4.0  25.0  4.0
a3  9.0  18.0  9.0
a4  9.0  18.0  9.0

In [154]:
df1.add(df1['a'])

     a  a1  a2  a3   b   c
a1 NaN NaN NaN NaN NaN NaN
a2 NaN NaN NaN NaN NaN NaN
a3 NaN NaN NaN NaN NaN NaN

In [155]:
df1.add(df1['a'], axis=0)

    a  b  c
a1  2  5  2
a2  4  7  4
a3  6  9  6

#### map

In [156]:
df = pd.read_table('table_data.txt', index_col='이름', sep='\t')
df.index.name = None
df

    성별  학년   출석   과제   중간   기말
김혁주  남   4   85   75   90   95
홍길동  남   3   85   90   85   88
유재석  남   3  100  100  100  100
장미란  여   4   90   85   80   78
박명수  남   4   90   80   80   80
정형돈  남   2   80   99   88   90
김연아  여   1   75   80  100  100
조유리  여   2   85   90   90   89
하동훈  남   1   75   85  100   85

In [157]:
def grade(x):
    if x == 1:
        return 'freshman'
    elif x == 2:
        return 'sophomore'
    elif x == 3:
        return 'junior'
    else:
        return 'senior'
    
def attend(x):
    if x >= 80:
        return 'pass'
    else:
        return 'fail'
    
def score(x):
    if x >= 90:
        return 'A'
    elif x >= 80:
        return 'B'
    else:
        return 'C'

In [158]:
df['학년'] = df['학년'].map(grade)
df['출석'] = df['출석'].map(attend)
df['과제'] = df['과제'].map(score)
df['중간'] = df['중간'].map(score)
df['기말'] = df['기말'].map(score)
df

    성별         학년    출석 과제 중간 기말
김혁주  남     senior  pass  C  A  A
홍길동  남     junior  pass  A  B  B
유재석  남     junior  pass  A  A  A
장미란  여     senior  pass  B  B  C
박명수  남     senior  pass  B  B  B
정형돈  남  sophomore  pass  A  B  A
김연아  여   freshman  fail  B  A  A
조유리  여  sophomore  pass  A  A  B
하동훈  남   freshman  fail  B  A  B

#### apply

In [159]:
df = pd.read_table('table_data.txt', index_col='이름', sep='\t')
df.drop(['성별', '학년'], axis=1, inplace=True)
df.index.name = None
df

      출석   과제   중간   기말
김혁주   85   75   90   95
홍길동   85   90   85   88
유재석  100  100  100  100
장미란   90   85   80   78
박명수   90   80   80   80
정형돈   80   99   88   90
김연아   75   80  100  100
조유리   85   90   90   89
하동훈   75   85  100   85

In [160]:
def over_mean(x):
    m = x.mean()
    over_mean = len(x[x > m])
    return pd.Series([m, over_mean], index = ['mean', 'number of over mean'])

In [161]:
df.apply(over_mean)

                       출석         과제         중간         기말
mean                 85.0  87.111111  90.333333  89.444444
number of over mean   3.0   4.000000   3.000000   4.000000

In [162]:
df.apply(over_mean, axis = 1)

       mean  number of over mean
김혁주   86.25                  2.0
홍길동   87.00                  2.0
유재석  100.00                  0.0
장미란   83.25                  2.0
박명수   82.50                  1.0
정형돈   89.25                  2.0
김연아   88.75                  2.0
조유리   88.50                  3.0
하동훈   86.25                  1.0

#### applymap

In [163]:
df = pd.read_table('table_data.txt', index_col='이름', sep='\t')
df.drop(['성별'], axis=1, inplace=True)
df.index.name = None
df

     학년   출석   과제   중간   기말
김혁주   4   85   75   90   95
홍길동   3   85   90   85   88
유재석   3  100  100  100  100
장미란   4   90   85   80   78
박명수   4   90   80   80   80
정형돈   2   80   99   88   90
김연아   1   75   80  100  100
조유리   2   85   90   90   89
하동훈   1   75   85  100   85

In [164]:
def f1(x):
    if x%2 == 1:
        return '홀'
    else:
        return '짝'
    
df.applymap(f1)

    학년 출석 과제 중간 기말
김혁주  짝  홀  홀  짝  홀
홍길동  홀  홀  짝  홀  짝
유재석  홀  짝  짝  짝  짝
장미란  짝  짝  홀  짝  짝
박명수  짝  짝  짝  짝  짝
정형돈  짝  짝  홀  짝  짝
김연아  홀  홀  짝  짝  짝
조유리  짝  홀  짝  짝  홀
하동훈  홀  홀  홀  짝  홀

#### groupby

In [165]:
df = pd.read_table('table_data.txt', index_col='이름', sep='\t')
df.index.name = None
df

    성별  학년   출석   과제   중간   기말
김혁주  남   4   85   75   90   95
홍길동  남   3   85   90   85   88
유재석  남   3  100  100  100  100
장미란  여   4   90   85   80   78
박명수  남   4   90   80   80   80
정형돈  남   2   80   99   88   90
김연아  여   1   75   80  100  100
조유리  여   2   85   90   90   89
하동훈  남   1   75   85  100   85

In [166]:
df.groupby('학년').get_group(1)

    성별  학년  출석  과제   중간   기말
김연아  여   1  75  80  100  100
하동훈  남   1  75  85  100   85

In [167]:
df.groupby(['성별', '학년']).get_group(('남', 3))

    성별  학년   출석   과제   중간   기말
홍길동  남   3   85   90   85   88
유재석  남   3  100  100  100  100

In [168]:
df.groupby('학년').apply(np.mean)[['출석', '과제', '중간', '기말']]

           출석    과제          중간         기말
학년
1   75.000000  82.5  100.000000  92.500000
2   82.500000  94.5   89.000000  89.500000
3   92.500000  95.0   92.500000  94.000000
4   88.333333  80.0   83.333333  84.333333

In [169]:
df.groupby('성별').apply(np.mean)[['출석', '과제', '중간', '기말']]

           출석         과제    중간         기말
성별
남   85.833333  88.166667  90.5  89.666667
여   83.333333  85.000000  90.0  89.000000

In [170]:
df.groupby(['학년', '성별']).apply(np.mean)[['출석', '과제', '중간', '기말']]

         출석    과제     중간     기말
학년 성별
1  남   75.0  85.0  100.0   85.0
   여   75.0  80.0  100.0  100.0
2  남   80.0  99.0   88.0   90.0
   여   85.0  90.0   90.0   89.0
3  남   92.5  95.0   92.5   94.0
4  남   87.5  77.5   85.0   87.5
   여   90.0  85.0   80.0   78.0